_Rarzrabotki/Kazna/Documents/БюджетМесяц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>БюджетМесяц</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛимитыНаМесяц</xr:Item>
				<xr:Item>AccumulationRegister.БюджетыНаМесяц</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПериодовБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВерсии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВерсийБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.БюджетМесяц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лимит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоказательБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.НаправленияДвиженийДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказателиБДДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоказательБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.НаправленияДвиженийДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыВерсийБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыВерсийБюджетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Первичный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыДенежныхСредств</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Documents/БюджетМесяц/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Объект.Ссылка.Пустая() Тогда
		//Объект.Месяц	= НачалоМесяца(ТекущаяДата());
		Объект.Месяц	= НачалоНедели(ТекущаяДата());
	КонецЕсли;
	УстановитьВидимостьОснования() ;

	
КонецПроцедуры

Процедура УстановитьВидимостьОснования()
	Если Объект.ВидВерсии=Перечисления.ВидыВерсийБюджетов.Корректировка Тогда
		Элементы.ДокументОснование.Видимость=Истина;
	Иначе	
		Элементы.ДокументОснование.Видимость=Ложь;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура МесяцНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка	= Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("МесяцНажатиеЗавершение", ЭтаФорма);
	ПоказатьВводДаты(ОписаниеОповещения, Объект.Месяц,, ЧастиДаты.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцНажатиеЗавершение(Дата, Параметры) Экспорт
	
	Если НЕ Дата = Неопределено Тогда
        //Объект.Месяц = НачалоМесяца(Дата);
		Объект.Месяц = НачалоНедели(Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидВерсииПриИзменении(Элемент)
	УстановитьВидимостьОснования() ;
КонецПроцедуры
 //Тютюн
&НаКлиенте
Процедура ЗагрузитьExel(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "xlsx (*.xlsx)|*.xlsx"; 
	Диалог.Фильтр = Фильтр; 
	Диалог.МножественныйВыбор = Ложь;	
	Диалог.Показать(Новый ОписаниеОповещения("ЗагрузитьФайлЗавершение", ЭтаФорма, Новый Структура("Диалог", Диалог)));
КонецПроцедуры  

&НаКлиенте
Процедура ЗагрузитьФайлЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог; 
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда				
		
		АдресВХ = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Диалог.ПолноеИмяФайла));
		Области =ОбработатьФайлНаСервере(АдресВХ); 
		ИмяОбласти = ВыбратьИзМеню(Области,Элементы.Подразделение);
		ЗаполнитьТабЧасть(ИмяОбласти.Значение);		
	КонецЕсли;
	
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьТабЧасть(Имя)  
	
	Для Каждого Область Из ТабДок.Области Цикл  
		Если СокрЛп(Область.Имя) = Имя Тогда 
		//Если СтрНачинаетсяС(Область.Имя, Имя) Тогда    
			
			МесяцГод = НазваниеМесяцаСГодом(Объект.Дата);
			
			КолонкаБезнал = Неопределено;
			Строка = Область.Верх + 2;
			Для НомерКолонки =2 По ТабДок.ШиринаСтраницы Цикл  
				Данные = ТабДок.Область(Строка, НомерКолонки, Строка, НомерКолонки).Текст; 
				Если МесяцГод =  Данные Тогда  
					КолонкаБезнал = НомерКолонки;
					Прервать;;
				КонецЕсли;
			КонецЦикла;
			
			Если КолонкаБезнал = Неопределено Тогда 
			 Сообщить("Не знайшли місяць, який відповідає даті документа!");
			Иначе
			Начало = Область.Верх+4;
			КоличествоСтрок = Область.Низ ;
			//КоличествоСтрок = Табдок.ВысотаТаблицы;  
			Н = 1; 
			КолонкаНал = КолонкаБезнал +1; 
			
			
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиДвиженияДенежныхСредств.Ссылка,
		|	СтатьиДвиженияДенежныхСредств.Наименование
		|ИЗ
		|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
		|ГДЕ
		|	НЕ СтатьиДвиженияДенежныхСредств.ЭтоГруппа
		|	И НЕ СтатьиДвиженияДенежныхСредств.Ссылка В ИЕРАРХИИ (&ГруппаНеУчитывать)";
	
	Запрос.УстановитьПараметр("ГруппаНеУчитывать", Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("УТ-000965"));
	Выборка =  Запрос.Выполнить().Выбрать();
	СоответствиеСтатей = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		СоответствиеСтатей.Вставить(Нрег(Выборка.Наименование),Выборка.Ссылка);
	КонецЦикла;
		
			
			Для НомерСтроки = Начало По КоличествоСтрок Цикл
				
				Если ТабДок.Область(НомерСтроки, Н, НомерСтроки, Н).шрифт.Размер = 8 Тогда 
				Наименование = ТабДок.Область(НомерСтроки, Н, НомерСтроки, Н).Текст; 
				Если не значениезаполнено(Наименование) Тогда 
					Продолжить;
				КонецЕсли;  
				Попытка
					Безнал       = Число(ТабДок.Область(НомерСтроки, КолонкаБезнал, НомерСтроки, КолонкаБезнал).Текст);
				Исключение 
					Безнал = 0;
				КонецПопытки;    
				
				Попытка
					Нал          = Число(ТабДок.Область(НомерСтроки, КолонкаНал, НомерСтроки, КолонкаНал).Текст); 
				Исключение 
					Нал    = 0;
				КонецПопытки;
				
				Если Безнал>0 Или Нал>0 Тогда 
					Статья = СоответствиеСтатей.Получить(Нрег(Наименование));
					Если ЗначениеЗаполнено(Статья) Тогда    
						
						Если Безнал>0 Тогда  
							ДобавитьСтрокуВТЧ(Статья,Безнал,Истина);
						КонецЕсли;
						
						Если Нал>0 Тогда  
							ДобавитьСтрокуВТЧ(Статья,Нал,Ложь);
						КонецЕсли;
						
					Иначе
						Сообщить("Не нашли статью " + Наименование);
					КонецЕсли;
				КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
		    КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры    

Процедура ДобавитьСтрокуВТЧ(Статья,Сумма,ЭтоБезнал); 
	
	Нстрока = Объект.ПоказателиБДДС.Добавить();
	Нстрока.ПоказательБюджета = Статья;
	Нстрока.Подразделение = Объект.Подразделение ; 
	Если ЭтоБезнал  Тогда 
		Нстрока.ВидОплаты = Перечисления.ВидыДенежныхСредств.Безналичные;
	Иначе 
		Нстрока.ВидОплаты = Перечисления.ВидыДенежныхСредств.Наличные;
	КонецЕсли;  
	Нстрока.Сумма = Сумма;
	
КонецПроцедуры

Функция НазваниеМесяцаСГодом(Дата) Экспорт
	
	// Проверяем, что передана дата
	Если ТипЗнч(Дата) <> Тип("Дата") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Список месяцев на украинском языке
	Месяцы = Новый Массив;
	Месяцы.Добавить("Січень");
	Месяцы.Добавить("Лютий");
	Месяцы.Добавить("Березень");
	Месяцы.Добавить("Квітень");
	Месяцы.Добавить("Травень");
	Месяцы.Добавить("Червень");
	Месяцы.Добавить("Липень");
	Месяцы.Добавить("Серпень");
	Месяцы.Добавить("Вересень");
	Месяцы.Добавить("Жовтень");
	Месяцы.Добавить("Листопад");
	Месяцы.Добавить("Грудень");
	
	// Получаем месяц и год
	НомерМесяца = Месяц(Дата);
	Год = СтрЗаменить(Год(Дата)," ","");
	
	// Формируем строку вида "Лютий 2025"
	Возврат Месяцы[НомерМесяца - 1] + " " + Строка(Год);
	
КонецФункции

&НаСервере
Функция ОбработатьФайлНаСервере(Адрес)
	
	//Загрузка из файла PromUA
	
	Объект.ПоказателиБДДС.Очистить();
	
	//ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	Попытка
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
		тПуть = КаталогВременныхФайлов() + "tmp.xlsx"; 
		ДвоичныеДанные.Записать(тПуть);	
		
		ТабДок.Прочитать(тПуть,СпособЧтенияЗначенийТабличногоДокумента.Значение);   
		
		Список = Новый СписокЗначений; 
		Для Каждого Строка Из ТабДок.Области Цикл  
			Список.Добавить(Строка.Имя);
		КонецЦикла;
		
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать указанный файл по причине: "+ ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;     
	
	Возврат Список
	
	
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры
